
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>平行化運算 - MPPMM5 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-disqus/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="3-2-OPENMP.html" />
    
    
    <link rel="prev" href="2-1-MM5.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="0-Preparation.html">
            
                <a href="0-Preparation.html">
            
                    
                    使用 MM5 的事前準備
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1-1-TERRAIN.html">
            
                <a href="1-1-TERRAIN.html">
            
                    
                    前置資料處理：地形地貌
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="1-2-REGRID.html">
            
                <a href="1-2-REGRID.html">
            
                    
                    前置資料處理 - 初始猜測場
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="1-3-LITTLE_R.html">
            
                <a href="1-3-LITTLE_R.html">
            
                    
                    前置資料處理 - 客觀分析
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="1-4-INTERPF.html">
            
                <a href="1-4-INTERPF.html">
            
                    
                    前置資料處理 - 垂直插值
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="2-1-MM5.html">
            
                <a href="2-1-MM5.html">
            
                    
                    進行模擬
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.8" data-path="3-1-MPPMM5.html">
            
                <a href="3-1-MPPMM5.html">
            
                    
                    平行化運算 - MPPMM5
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="3-2-OPENMP.html">
            
                <a href="3-2-OPENMP.html">
            
                    
                    平行化運算 - OpenMP
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="4-1-INTERPB.html">
            
                <a href="4-1-INTERPB.html">
            
                    
                    後處理 - 垂直插值
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="5-1-MM5toGrADS.html">
            
                <a href="5-1-MM5toGrADS.html">
            
                    
                    後處理 - 轉為GrADS格式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="A-1-ModTER.html">
            
                <a href="A-1-ModTER.html">
            
                    
                    附錄 - 進階修改：修改 MM5 地形高度（地形敏感度測試）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="A-2-ModSST.html">
            
                <a href="A-2-ModSST.html">
            
                    
                    附錄 - 進階修改：修改 MM5 海溫資料
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="A-3-NonSTDOP.html">
            
                <a href="A-3-NonSTDOP.html">
            
                    
                    附錄 - 進階修改：非標準資料之輸出
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="A-4-VarList.html">
            
                <a href="A-4-VarList.html">
            
                    
                    附錄 - MM5 變數表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="A-5-SubList.html">
            
                <a href="A-5-SubList.html">
            
                    
                    附錄 - MM5 副程式對照表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="Reference.html">
            
                <a href="Reference.html">
            
                    
                    Reference / 致謝
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >平行化運算 - MPPMM5</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5E73;&#x884C;&#x5316;&#x904B;&#x7B97;---mppmm5">&#x5E73;&#x884C;&#x5316;&#x904B;&#x7B97; - MPPMM5</h1>
<p>&#x65E9;&#x5728; 1998 &#x5E74;&#x7684; MM5V2.8 &#x88E1;&#x51FA;&#x73FE;&#x4E86;&#x9019;&#x6B3E;&#x8B93; MM5 &#x63A1;&#x7528;&#x5206;&#x6563;&#x5F0F;&#x8A18;&#x61B6;&#x9AD4;&#xFF08;Distributed Memory, DM&#xFF09;&#x4EE5;&#x53CA;&#x5927;&#x91CF;&#x5E73;&#x884C;&#x904B;&#x7B97;&#x8655;&#x7406;&#x5668;&#xFF08;Massively Parallel Processors, MPP&#xFF09;&#x4F86;&#x9032;&#x884C;&#x5E73;&#x884C;&#x904B;&#x7B97;&#x7684;&#x5957;&#x4EF6;&#x3002;&#x5BE6;&#x4F5C;&#x4E0A;&#x662F;&#x900F;&#x904E;&#x4F7F;&#x7528; RSL &#x7684; MPI &#x8A0A;&#x606F;&#x50B3;&#x905E;&#x7CFB;&#x7D71;&#x51FD;&#x5F0F;&#x5EAB;&#x4F86;&#x9032;&#x884C;&#x3002;</p>
<p>&#x8981;&#x4F7F;&#x7528; MPPMM5 &#x6703;&#x9700;&#x8981; MM5 &#x4E3B;&#x7A0B;&#x5F0F;&#x3001;MPP &#x5957;&#x4EF6;&#x3001;pgf77&#x3001;<a href="https://www.mpich.org/" target="_blank">MPICH</a>&#x3002;</p>
<h2 id="&#x7DE8;&#x8B6F;-mpp-mm5">&#x7DE8;&#x8B6F; MPP MM5</h2>
<ol>
<li><strong>&#x89E3;&#x58D3;&#x7E2E;</strong>&#xFF1A;<code>tar &#x2013;zxvf ../MPP.tar.gz</code> 
&#x8ACB;&#x5C07;&#x89E3;&#x58D3;&#x7E2E;&#x5F8C;&#x7684; MPP &#x8CC7;&#x6599;&#x593E;&#x79FB;&#x52D5;&#x5230; MM5 &#x8CC7;&#x6599;&#x593E;&#x4E0B;&#x3002;</li>
<li><strong>&#x4FEE;&#x6539; MM5/configure.user</strong>&#xFF1A; 
&#x8ACB;&#x5148;&#x5C07;&#x57FA;&#x672C;&#x7684;&#x6A21;&#x5F0F;&#x53C3;&#x6578;&#x3001;&#x7269;&#x7406;&#x53C3;&#x6578;&#x5982;&#x540C; MM5 &#x7684;&#x7AE0;&#x7BC0;&#x4E2D;&#x6240;&#x8FF0;&#x8A2D;&#x5B9A;&#x5B8C;&#x5F8C;&#xFF0C;&#x4F9D;&#x64DA;&#x4F60;&#x7684;&#x96FB;&#x8166;&#x67B6;&#x69CB;&#x4EE5;&#x53CA;&#x7DE8;&#x8B6F;&#x5668;&#x5C07;&#x6BB5;&#x843D;&#x4E03;&#x4E2D;&#x76F8;&#x61C9;&#x8A2D;&#x5B9A;&#x7684;&#x8A3B;&#x89E3;&#x62FF;&#x6389;&#xFF0C;&#x4F8B;&#x5982;&#x6211;&#x9019;&#x908A;&#x4F7F;&#x7528;&#x7684;&#x6A5F;&#x5668;&#x662F; Linux &#x8207; PGI &#x7DE8;&#x8B6F;&#x5668;&#xFF0C;&#x90A3;&#x9EBC;&#x5C31;&#x662F;&#x628A; 7g1 &#x7684;&#x8A3B;&#x89E3;&#x62FF;&#x6389;&#xFF0C;&#x518D;&#x4F9D;&#x64DA;&#x74B0;&#x5883;&#x505A;&#x9069;&#x7576;&#x4FEE;&#x6539;&#xFF08;&#x8981;&#x6CE8;&#x610F;&#x6BB5;&#x843D; 3 &#x88E1;&#x7684;&#x8A2D;&#x5B9A;&#x4E0D;&#x662F;&#x7D66; MPP &#x7528;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x90FD;&#x8981;&#x8A3B;&#x89E3;&#x6389;&#xFF09;&#x3002;</li>
<li><strong>&#x7DE8;&#x8B6F;</strong>&#xFF1A;<code>make mpp</code> 
&#x4FEE;&#x6539;&#x5B8C; configure.user &#x5F8C;&#x76F4;&#x63A5;&#x7DE8;&#x8B6F;&#x5C31;&#x597D;&#xFF0C;&#x5982;&#x679C;&#x9019;&#x4E0D;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x7DE8;&#x8B6F;&#xFF0C;&#x8ACB;&#x5148;&#x57F7;&#x884C; <code>make uninstall</code> &#x6E05;&#x7406;&#x90A3;&#x4E9B;&#x5DF2;&#x7D93;&#x7DE8;&#x8B6F;&#x904E;&#x7684;&#x6A94;&#x6848;&#x3002;&#x5982;&#x679C;&#x6C92;&#x6709;&#x610F;&#x5916;&#x7684;&#x8A71;&#x61C9;&#x8A72;&#x6703;&#x5728; MM5/Run &#x4E0B;&#x7522;&#x751F; mm5.mpp &#x9019;&#x652F;&#x7A0B;&#x5F0F;&#xFF08;&#x6709;&#x610F;&#x5916;&#x767C;&#x751F;&#x7684;&#x8A71;&#x8ACB;&#x4E0D;&#x8981;&#x592A;&#x610F;&#x5916;&#xFF09;&#x3002;
&#x8ACB;&#x6CE8;&#x610F;&#xFF1A;&#x82E5;&#x5C07;&#x4E00;&#x4EFD;&#x5B89;&#x88DD;&#x597D;&#x7684; MPP MM5 &#x79FB;&#x52D5;&#x5230;&#x5225;&#x8655;&#x53EF;&#x80FD;&#x5C31;&#x6703;&#x5931;&#x6548;&#xFF0C;&#x88E1;&#x9762;&#x4F3C;&#x4E4E;&#x6709;&#x4E00;&#x4E9B;&#x7D55;&#x5C0D;&#x8DEF;&#x5F91;&#x7684;&#x8A2D;&#x5B9A;&#xFF0C;&#x63DB;&#x500B;&#x5730;&#x65B9;&#x704C;&#x8ACB;&#x91CD;&#x65B0;&#x7DE8;&#x8B6F;&#x4E00;&#x6B21;&#x3002;</li>
<li><strong>&#x88FD;&#x4F5C;&#x4E26;&#x4FEE;&#x6539; mm5.deck</strong>&#xFF1A;<code>make mm5.deck</code> 
&#x9019;&#x500B;&#x7248;&#x672C;&#x7684; mm5.deck &#x4E26;&#x4E0D;&#x6703;&#x8CA0;&#x8CAC;&#x57F7;&#x884C; MM5 &#x4E3B;&#x7A0B;&#x5F0F;&#xFF0C;&#x50C5;&#x6709;&#x7522;&#x751F; namelist &#x7684;&#x529F;&#x7528;&#xFF08;&#x53EF;&#x4EE5;&#x6BD4;&#x8F03;&#x9019;&#x500B; mm5.deck &#x7684;&#x6700;&#x5F8C;&#x4E00;&#x6BB5;&#x8DDF;&#x4E00;&#x822C;&#x55AE;&#x6838; MM5 &#x6240;&#x7528;&#x7684; mm5.deck &#x88E1;&#x6700;&#x5F8C;&#x4E00;&#x6BB5;&#x7684;&#x5167;&#x5BB9;&#xFF0C;&#x6703;&#x767C;&#x73FE;&#x6307;&#x4EE4;&#x6709;&#x4E9B;&#x8A31;&#x4E0D;&#x540C;&#xFF09;</li>
<li><strong>&#x958B;&#x59CB;&#x6A21;&#x64EC;</strong>&#xFF1A; 
&#x958B;&#x59CB;&#x6A21;&#x64EC;&#x524D;&#x540C;&#x6A23;&#x4E5F;&#x662F;&#x8981;&#x5C07;&#x8A72;&#x6E96;&#x5099;&#x7684;&#x8CC7;&#x6599;&#x5982; BDYOUT_DOMAIN1 &#x7B49;&#x6A94;&#x6848;&#x6E96;&#x5099;&#x597D;&#xFF0C;&#x6240;&#x6709;&#x8CC7;&#x6599;&#x6E96;&#x5099;&#x5C31;&#x7DD2;&#x4E4B;&#x5F8C;&#xFF0C;&#x57F7;&#x884C; <code>mpiexec &#x2013;np 4 mm5.mpp</code> &#x5982;&#x6B64;&#x5C07;&#x6703;&#x4F7F;&#x7528; 4 &#x500B;&#x57F7;&#x884C;&#x7DD2;&#x9032;&#x884C;&#x5E73;&#x884C;&#x904B;&#x7B97;&#xFF08;&#x63DB;&#x7528; mpirun &#x53D6;&#x4EE3; mpiexec &#x4E5F;&#x884C;&#xFF0C;&#x5169;&#x8005;&#x5DEE;&#x7570;&#x8ACB;&#x898B; <a href="http://stackoverflow.com/questions/25287981/mpiexec-vs-mpirun" target="_blank">Stackoverflow: mpiexec vs mpirun</a>&#xFF09;&#x3002;&#x540C;&#x6A23;&#x7684;&#xFF0C;&#x9019;&#x4E9B;&#x6B65;&#x9A5F;&#x4E5F;&#x53EF;&#x4EE5;&#x5229;&#x7528; <code>qsub</code> &#x6307;&#x4EE4;&#x4F86;&#x5C07;&#x5B83;&#x4E1F;&#x9032; TORQUE &#x7684;&#x5DE5;&#x4F5C;&#x6392;&#x7A0B;&#x4E2D;&#xFF0C;&#x8DDF;&#x55AE;&#x6838; MM5 &#x90A3;&#x908A;&#x95DC;&#x65BC;&#x958B;&#x59CB;&#x9032;&#x884C;&#x6A21;&#x64EC;&#x7684;&#x90E8;&#x4EFD;&#x4E00;&#x6A23;&#x3002;</li>
</ol>
<p>&#x6A21;&#x64EC;&#x7D50;&#x675F;&#x5F8C;&#xFF0C;&#x8207;&#x55AE;&#x6838; MM5 &#x4E0D;&#x540C;&#x7684;&#x662F;&#x5728; MM5/Run/restrts &#x4E0B;&#x6703;&#x51FA;&#x73FE;&#x6BCF;&#x500B;&#x57F7;&#x884C;&#x7DD2;&#x81EA;&#x5DF1;&#x7684; Restart File&#x3002;&#x53E6;&#x5916;&#x6703;&#x7522;&#x751F; rsl.out.0000&#x3001;rsl.out.0001.....&#x7B49;&#x8F38;&#x51FA;&#x8CC7;&#x8A0A;&#xFF0C;&#x4EE5;&#x53CA; rsl.error.0000&#x3001;rsl.error.0001.....&#x7B49;&#x5075;&#x932F;&#x8CC7;&#x8A0A;&#x3002;</p>
<h2 id="&#x9664;&#x932F;">&#x9664;&#x932F;</h2>
<p>&#x5982;&#x540C;&#x4E0A;&#x9762;&#x6240;&#x8AAA;&#xFF0C;&#x5B89;&#x88DD;&#x6642;&#x4E0D;&#x5927;&#x53EF;&#x80FD;&#x592A;&#x9806;&#x5229;&#xFF0C;&#x5F88;&#x9806;&#x5229;&#x7684;&#x8A71;&#x90A3;....&#x606D;&#x559C;&#x4F60;&#xFF0C;&#x4E00;&#x5B9A;&#x662F;&#x4F60;&#x4E0A;&#x8F29;&#x5B50;&#x6709;&#x71D2;&#x597D;&#x9999;&#x3002;&#x5176;&#x4E2D;&#x6703;&#x4E0D;&#x9806;&#x5229;&#x7684;&#x90E8;&#x4EFD;&#x539F;&#x56E0;&#x662F;&#x56E0;&#x70BA;&#x6211;&#x5011;&#x7684;&#x6A5F;&#x5668;&#x662F; 64 bits &#x7684;&#x6A5F;&#x5668;&#xFF0C;&#x5982;&#x6B64;&#x5728;&#x8B8A;&#x6578;&#x7684;&#x9577;&#x5EA6;&#x4E0A;&#x6703;&#x6709;&#x4E00;&#x4E9B;&#x5DEE;&#x7570;&#xFF0C;&#x4F8B;&#x5982;&#x9577;&#x6574;&#x6578;&#x53EF;&#x80FD;&#x4E5F;&#x4E0D;&#x662F;&#x9810;&#x671F;&#x4E2D;&#x7684; 64 &#x4F4D;&#x5143;&#x800C;&#x662F; 32 &#x4F4D;&#x5143;&#xFF08;&#x8A73;&#x898B;&#x300C;<a href="https://dada.tw/2008/04/18/85/" target="_blank">&#x9577;&#x6574;&#x6578;&#x5404;&#x81EA;&#x8868;&#x8FF0;</a>&#x300D;&#x9019;&#x7BC7;&#x6587;&#x7AE0;&#xFF09;&#x3002;&#x53E6;&#x4E00;&#x90E8;&#x4EFD;&#x5C31;&#x662F;&#x7A0B;&#x5F0F;&#x672C;&#x8EAB;&#x7684; bug &#x4E86;&#xFF0C;MM5 &#x5B98;&#x65B9;&#x7DB2;&#x7AD9;&#x7684; <a href="http://www2.mmm.ucar.edu/mm5/mpp/mm5e-usage.html" target="_blank">HelpDesk</a> &#x5217;&#x51FA;&#x4E86;&#x4E00;&#x4E9B;&#x554F;&#x984C;&#x4EE5;&#x53CA;&#x89E3;&#x6C7A;&#x65B9;&#x6848;&#x3002;&#x5728;&#x7DE8;&#x8B6F;&#x6642;&#x6240;&#x51FA;&#x73FE;&#x7684; Error &#x932F;&#x8AA4;&#x8A0A;&#x606F;&#x82E5;&#x4E0D;&#x89E3;&#x6C7A;&#x7684;&#x8A71;&#x662F;&#x4E0D;&#x80FD;&#x8DD1;&#x7684;&#xFF0C;&#x800C; Warning &#x76F8;&#x5C0D;&#x4F86;&#x8AAA;&#x5C31;&#x6BD4;&#x8F03;&#x6B21;&#x8981;&#x4E86;&#xFF0C;&#x591A;&#x534A;&#x53EF;&#x80FD;&#x662F;&#x578B;&#x5225;&#x8F49;&#x63DB;&#x7684;&#x8B66;&#x544A; <em>warning: initialization makes integer from pointer without a cast, cast to pointer from integer of different size</em></p>
<h2 id="&#x6548;&#x80FD;&#x6BD4;&#x8F03;">&#x6548;&#x80FD;&#x6BD4;&#x8F03;</h2>
<p>&#x95DC;&#x65BC;&#x63A1;&#x7528;&#x5E7E;&#x500B;&#x57F7;&#x884C;&#x7DD2;&#x53EF;&#x4EE5;&#x9054;&#x5230;&#x6700;&#x597D;&#x7684;&#x6548;&#x80FD;&#xFF0C;&#x53EF;&#x4EE5;&#x53C3;&#x8003; MM5 MPP Helpdesk &#x4E0A;&#x7684; <a href="http://www2.mmm.ucar.edu/mm5/mpp/helpdesk/20040304a.html" target="_blank">Parallel MM5 benchmarks, 2004</a>&#x3002;&#x5728;&#x5BE6;&#x9A57;&#x5BA4;&#x88E1;&#x7684;&#x4E3B;&#x6A5F;&#x4E0A;&#xFF0C;&#x900F;&#x904E;&#x694A;&#x660E;&#x4EC1;&#x6559;&#x6388;&#x5C0D;&#x7D0D;&#x8389;&#x98B1;&#x98A8;&#xFF08;2001&#xFF09;&#x63A1;&#x7528; 6 &#x79D2;&#x7684;&#x6642;&#x9593;&#x6B65;&#x9577;&#x3001;&#x5169;&#x516C;&#x91CC;&#x7684;&#x7DB2;&#x683C;&#x9593;&#x8DDD;&#xFF0C;271 x 301 x 31 &#x500B;&#x7DB2;&#x683C;&#x9EDE;&#x4F7F;&#x7528;&#x55AE;&#x57F7;&#x884C;&#x7DD2;&#x9032;&#x884C;&#x6A21;&#x64EC;&#x6240;&#x5F97;&#x51FA;&#x4F86;&#x7684;&#x7D50;&#x679C;&#x662F;&#x6240;&#x9700;&#x6642;&#x9593;&#x70BA;&#x6A21;&#x64EC;&#x6642;&#x9593;&#x7684;&#x4E09;&#x500D;&#xFF08;&#x771F;&#x5BE6;&#x4E16;&#x754C;&#x516D;&#x5C0F;&#x6642;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x5169;&#x5C0F;&#x6642;&#x7684;&#x6A21;&#x64EC;&#x7D50;&#x679C;&#xFF09;&#x3002;&#x82E5;&#x63A1;&#x7528;&#x76F8;&#x540C;&#x8A2D;&#x5B9A;&#xFF0C;&#x4F46;&#x4EE5;&#x5169;&#x500B;&#x57F7;&#x884C;&#x7DD2;&#x9032;&#x884C;&#x5E73;&#x884C;&#x904B;&#x7B97;&#x5247;&#x662F;&#x8B93;&#x6240;&#x9700;&#x6642;&#x9593;&#x7E2E;&#x77ED;&#x70BA;&#x6A21;&#x64EC;&#x6642;&#x9593;&#x7684;&#x5169;&#x500D;&#x3002;</p>
<p>&#x5BE6;&#x969B;&#x6A21;&#x64EC;&#x6642;&#x6240;&#x7528;&#x7684;&#x57F7;&#x884C;&#x7DD2;&#x6578;&#x91CF;&#x6703;&#x6709;&#x500B;&#x6539;&#x9032;&#x6975;&#x9650;&#xFF0C;&#x4E26;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x55AE;&#x7D14;&#x7684;&#x7DDA;&#x6027;&#x500D;&#x589E;&#x3002;&#x9019;&#x727D;&#x626F;&#x5230;&#x4E86;&#x5167;&#x90E8;&#x7A0B;&#x5F0F;&#x78BC;&#x7684;&#x7DE8;&#x5BEB;&#x65B9;&#x5F0F;&#x4EE5;&#x53CA;&#x6A5F;&#x5668;&#x9593;&#x7684;&#x8CC7;&#x6599;&#x4EA4;&#x63DB;&#xFF0C;&#x6709;&#x8208;&#x8DA3;&#x53EF;&#x4EE5;&#x53BB;&#x7814;&#x7A76;&#x5E73;&#x884C;&#x904B;&#x7B97;&#x7684;&#x76F8;&#x95DC;&#x8CC7;&#x6599;&#x3002;&#x4E0B;&#x5716;&#x4F86;&#x81EA;&#x65BC;&#x524D;&#x8FF0;&#x7684; benchmark &#x7DB2;&#x9801;&#xFF0C;&#x70BA;&#x91DD;&#x5C0D;&#x540C;&#x4E00;&#x500B;&#x6A21;&#x64EC;&#x500B;&#x6848;&#x63A1;&#x7528;&#x4E0D;&#x540C;&#x5E73;&#x53F0;&#x3001;&#x4E0D;&#x540C;&#x8655;&#x7406;&#x5668;&#x6578;&#x91CF;&#x7684;&#x8868;&#x73FE;&#xFF1A; 
<img src="images/floating-point-performance.jpg" alt="MM5 Performance Plot"></p>
<p>&#x53E6;&#x5916;&#x7D93;&#x5BE6;&#x9A57;&#x8B49;&#x660E;&#x5176;&#x5BE6;&#x55AE;&#x57F7;&#x884C;&#x7DD2;&#x8207;&#x591A;&#x57F7;&#x884C;&#x7DD2;&#x7684;&#x5E73;&#x884C;&#x5316;&#x6A21;&#x64EC;&#x7D50;&#x679C;&#x4E26;&#x4E0D;&#x6703;&#x767E;&#x5206;&#x4E4B;&#x767E;&#x76F8;&#x540C;&#xFF08;&#x8A73;&#x7D30;&#x5DEE;&#x7570;&#x5927;&#x5C0F;&#x6211;&#x6C92;&#x6709;&#x9032;&#x4E00;&#x6B65;&#x53BB;&#x91CF;&#x5316;&#x5206;&#x6790;&#xFF0C;&#x6709;&#x8208;&#x8DA3;&#x53EF;&#x4EE5;&#x8A66;&#x8A66;&#x770B;&#xFF0C;&#x6216;&#x662F;&#x627E;&#x627E;&#x6709;&#x6C92;&#x6709;&#x76F8;&#x95DC;&#x8CC7;&#x6599;&#xFF09;&#x521D;&#x6B65;&#x63A8;&#x6E2C;&#x53EF;&#x80FD;&#x662F;&#x56E0;&#x70BA;&#x5728;&#x5E73;&#x884C;&#x904B;&#x7B97;&#x6642;&#x6A21;&#x5F0F;&#x7684;&#x5E73;&#x8861;&#x689D;&#x4EF6;&#x6703;&#x4E0D;&#x540C;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x6578;&#x503C;&#x4E0A;&#x7684;&#x8AA4;&#x5DEE;&#x56E0;&#x6B64;&#x9020;&#x6210;&#x4E0D;&#x540C;&#x7684;&#x7D50;&#x679C;&#x3002;</p>
<p>&#x7E3D;&#x4E4B;&#xFF0C;&#x500B;&#x4EBA;&#x8A8D;&#x70BA;&#x5617;&#x8A66;&#x5C07;&#x9019;&#x500B;&#x985E;&#x6BD4;&#x7684;&#x4E16;&#x754C;&#x4EE5;&#x6578;&#x4F4D;&#x7684;&#x65B9;&#x5F0F;&#x8868;&#x793A;&#x6642;&#x5C31;&#x5DF2;&#x7D93;&#x6C92;&#x6709;&#x6240;&#x8B02;&#x7D55;&#x5C0D;&#x7684;&#x6B63;&#x78BA;&#x503C;&#x4E86;&#xFF0C;&#x7AEF;&#x770B;&#x4F60;&#x662F;&#x7AD9;&#x5728;&#x54EA;&#x88E1;&#x7576;&#x4F5C;&#x4F60;&#x7814;&#x7A76;&#x7684;&#x57FA;&#x6E96;&#x9EDE;&#x7F77;&#x4E86;&#x3002;</p>
<p><em>&#x507D;&#x7269;&#x6BD4;&#x771F;&#x7269;&#x6709;&#x8457;&#x58D3;&#x5012;&#x6027;&#x7684;&#x50F9;&#x503C;&#xFF0C;&#x55AE;&#x6191;&#x90A3;&#x4EFD;&#x60F3;&#x8981;&#x6210;&#x70BA;&#x771F;&#x7684;&#x6771;&#x897F;&#x7684;&#x610F;&#x5FD7;&#xFF0C;&#x5C31;&#x5DF2;&#x7D93;&#x6BD4;&#x771F;&#x7684;&#x6771;&#x897F;&#x66F4;&#x771F;&#x3002;&#xFF08;&#x507D;&#x7269;&#x306E;&#x65B9;&#x304C;&#x5727;&#x5012;&#x7684;&#x306B;&#x4FA1;&#x5024;&#x304C;&#x3042;&#x308B;&#x3002;&#x305D;&#x3053;&#x306B;&#x672C;&#x7269;&#x306B;&#x306A;&#x308D;&#x3046;&#x3068;&#x3044;&#x3046;&#x610F;&#x5FD7;&#x304C;&#x3042;&#x308B;&#x3060;&#x3051;&#x3001;&#x507D;&#x7269;&#x306E;&#x65B9;&#x304C;&#x672C;&#x7269;&#x3088;&#x308A;&#x672C;&#x7269;&#x3060;  &#x2015;&#x300C;&#x507D;&#x7269;&#x8A9E;&#x300D;&#xFF09;</em></p>
<p>&#x6578;&#x503C;&#x6A21;&#x64EC;&#x4E0D;&#x5C31;&#x662F;&#x9019;&#x9EBC;&#x4E00;&#x56DE;&#x4E8B;&#x55CE;&#xFF1B;&#xFF09;</p>
<p>&#x53C3;&#x8003;&#xFF1A;<a href="http://www2.mmm.ucar.edu/mm5/mpp.html" target="_blank">http://www2.mmm.ucar.edu/mm5/mpp.html</a></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2-1-MM5.html" class="navigation navigation-prev " aria-label="Previous page: 進行模擬">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="3-2-OPENMP.html" class="navigation navigation-next " aria-label="Next page: 平行化運算 - OpenMP">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"平行化運算 - MPPMM5","level":"1.8","depth":1,"next":{"title":"平行化運算 - OpenMP","level":"1.9","depth":1,"path":"3-2-OPENMP.md","ref":"3-2-OPENMP.md","articles":[]},"previous":{"title":"進行模擬","level":"1.7","depth":1,"path":"2-1-MM5.md","ref":"2-1-MM5.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["disqus"],"pluginsConfig":{"disqus":{"useIdentifier":false,"shortName":"nothing-here"},"sharing":{"facebook":true,"twitter":true,"google":true,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","instapaper","instapaper"]},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"3-1-MPPMM5.md","mtime":"2021-03-28T14:57:54.989Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-03-28T14:58:25.228Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/URI.js/1.16.1/URI.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-disqus/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

